grevaillot/svd_tools/headers/STM32H750x/hsem.h
/** @defgroup hsem_hsem_r0 HSEMR0 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R0_LOCK Lock indication **/
#define HSEM_HSEM_R0_LOCK		(1 << 31)

#define HSEM_HSEM_R0_MASTERID_SHIFT		8
#define HSEM_HSEM_R0_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r0_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R0_PROCID_SHIFT		0
#define HSEM_HSEM_R0_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r0_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r1 HSEMR1 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R1_LOCK Lock indication **/
#define HSEM_HSEM_R1_LOCK		(1 << 31)

#define HSEM_HSEM_R1_MASTERID_SHIFT		8
#define HSEM_HSEM_R1_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r1_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R1_PROCID_SHIFT		0
#define HSEM_HSEM_R1_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r1_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r2 HSEMR2 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R2_LOCK Lock indication **/
#define HSEM_HSEM_R2_LOCK		(1 << 31)

#define HSEM_HSEM_R2_MASTERID_SHIFT		8
#define HSEM_HSEM_R2_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r2_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R2_PROCID_SHIFT		0
#define HSEM_HSEM_R2_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r2_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r3 HSEMR3 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R3_LOCK Lock indication **/
#define HSEM_HSEM_R3_LOCK		(1 << 31)

#define HSEM_HSEM_R3_MASTERID_SHIFT		8
#define HSEM_HSEM_R3_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r3_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R3_PROCID_SHIFT		0
#define HSEM_HSEM_R3_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r3_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r4 HSEMR4 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R4_LOCK Lock indication **/
#define HSEM_HSEM_R4_LOCK		(1 << 31)

#define HSEM_HSEM_R4_MASTERID_SHIFT		8
#define HSEM_HSEM_R4_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r4_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R4_PROCID_SHIFT		0
#define HSEM_HSEM_R4_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r4_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r5 HSEMR5 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R5_LOCK Lock indication **/
#define HSEM_HSEM_R5_LOCK		(1 << 31)

#define HSEM_HSEM_R5_MASTERID_SHIFT		8
#define HSEM_HSEM_R5_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r5_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R5_PROCID_SHIFT		0
#define HSEM_HSEM_R5_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r5_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r6 HSEMR6 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R6_LOCK Lock indication **/
#define HSEM_HSEM_R6_LOCK		(1 << 31)

#define HSEM_HSEM_R6_MASTERID_SHIFT		8
#define HSEM_HSEM_R6_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r6_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R6_PROCID_SHIFT		0
#define HSEM_HSEM_R6_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r6_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r7 HSEMR7 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R7_LOCK Lock indication **/
#define HSEM_HSEM_R7_LOCK		(1 << 31)

#define HSEM_HSEM_R7_MASTERID_SHIFT		8
#define HSEM_HSEM_R7_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r7_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R7_PROCID_SHIFT		0
#define HSEM_HSEM_R7_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r7_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r8 HSEMR8 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R8_LOCK Lock indication **/
#define HSEM_HSEM_R8_LOCK		(1 << 31)

#define HSEM_HSEM_R8_MASTERID_SHIFT		8
#define HSEM_HSEM_R8_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r8_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R8_PROCID_SHIFT		0
#define HSEM_HSEM_R8_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r8_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r9 HSEMR9 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R9_LOCK Lock indication **/
#define HSEM_HSEM_R9_LOCK		(1 << 31)

#define HSEM_HSEM_R9_MASTERID_SHIFT		8
#define HSEM_HSEM_R9_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r9_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R9_PROCID_SHIFT		0
#define HSEM_HSEM_R9_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r9_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r10 HSEMR10 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R10_LOCK Lock indication **/
#define HSEM_HSEM_R10_LOCK		(1 << 31)

#define HSEM_HSEM_R10_MASTERID_SHIFT		8
#define HSEM_HSEM_R10_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r10_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R10_PROCID_SHIFT		0
#define HSEM_HSEM_R10_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r10_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r11 HSEMR11 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R11_LOCK Lock indication **/
#define HSEM_HSEM_R11_LOCK		(1 << 31)

#define HSEM_HSEM_R11_MASTERID_SHIFT		8
#define HSEM_HSEM_R11_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r11_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R11_PROCID_SHIFT		0
#define HSEM_HSEM_R11_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r11_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r12 HSEMR12 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R12_LOCK Lock indication **/
#define HSEM_HSEM_R12_LOCK		(1 << 31)

#define HSEM_HSEM_R12_MASTERID_SHIFT		8
#define HSEM_HSEM_R12_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r12_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R12_PROCID_SHIFT		0
#define HSEM_HSEM_R12_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r12_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r13 HSEMR13 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R13_LOCK Lock indication **/
#define HSEM_HSEM_R13_LOCK		(1 << 31)

