grevaillot/svd_tools/headers/STM32H750x/hsem.h
#define HSEM_HSEM_R13_MASTERID_SHIFT		8
#define HSEM_HSEM_R13_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r13_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R13_PROCID_SHIFT		0
#define HSEM_HSEM_R13_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r13_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r14 HSEMR14 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R14_LOCK Lock indication **/
#define HSEM_HSEM_R14_LOCK		(1 << 31)

#define HSEM_HSEM_R14_MASTERID_SHIFT		8
#define HSEM_HSEM_R14_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r14_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R14_PROCID_SHIFT		0
#define HSEM_HSEM_R14_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r14_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r15 HSEMR15 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R15_LOCK Lock indication **/
#define HSEM_HSEM_R15_LOCK		(1 << 31)

#define HSEM_HSEM_R15_MASTERID_SHIFT		8
#define HSEM_HSEM_R15_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r15_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R15_PROCID_SHIFT		0
#define HSEM_HSEM_R15_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r15_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r16 HSEMR16 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R16_LOCK Lock indication **/
#define HSEM_HSEM_R16_LOCK		(1 << 31)

#define HSEM_HSEM_R16_MASTERID_SHIFT		8
#define HSEM_HSEM_R16_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r16_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R16_PROCID_SHIFT		0
#define HSEM_HSEM_R16_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r16_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r17 HSEMR17 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R17_LOCK Lock indication **/
#define HSEM_HSEM_R17_LOCK		(1 << 31)

#define HSEM_HSEM_R17_MASTERID_SHIFT		8
#define HSEM_HSEM_R17_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r17_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R17_PROCID_SHIFT		0
#define HSEM_HSEM_R17_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r17_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r18 HSEMR18 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R18_LOCK Lock indication **/
#define HSEM_HSEM_R18_LOCK		(1 << 31)

#define HSEM_HSEM_R18_MASTERID_SHIFT		8
#define HSEM_HSEM_R18_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r18_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R18_PROCID_SHIFT		0
#define HSEM_HSEM_R18_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r18_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r19 HSEMR19 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R19_LOCK Lock indication **/
#define HSEM_HSEM_R19_LOCK		(1 << 31)

#define HSEM_HSEM_R19_MASTERID_SHIFT		8
#define HSEM_HSEM_R19_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r19_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R19_PROCID_SHIFT		0
#define HSEM_HSEM_R19_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r19_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r20 HSEMR20 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R20_LOCK Lock indication **/
#define HSEM_HSEM_R20_LOCK		(1 << 31)

#define HSEM_HSEM_R20_MASTERID_SHIFT		8
#define HSEM_HSEM_R20_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r20_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R20_PROCID_SHIFT		0
#define HSEM_HSEM_R20_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r20_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r21 HSEMR21 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R21_LOCK Lock indication **/
#define HSEM_HSEM_R21_LOCK		(1 << 31)

#define HSEM_HSEM_R21_MASTERID_SHIFT		8
#define HSEM_HSEM_R21_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r21_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R21_PROCID_SHIFT		0
#define HSEM_HSEM_R21_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r21_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r22 HSEMR22 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R22_LOCK Lock indication **/
#define HSEM_HSEM_R22_LOCK		(1 << 31)

#define HSEM_HSEM_R22_MASTERID_SHIFT		8
#define HSEM_HSEM_R22_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r22_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R22_PROCID_SHIFT		0
#define HSEM_HSEM_R22_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r22_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r23 HSEMR23 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R23_LOCK Lock indication **/
#define HSEM_HSEM_R23_LOCK		(1 << 31)

#define HSEM_HSEM_R23_MASTERID_SHIFT		8
#define HSEM_HSEM_R23_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r23_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R23_PROCID_SHIFT		0
#define HSEM_HSEM_R23_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r23_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r24 HSEMR24 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R24_LOCK Lock indication **/
#define HSEM_HSEM_R24_LOCK		(1 << 31)

#define HSEM_HSEM_R24_MASTERID_SHIFT		8
#define HSEM_HSEM_R24_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r24_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R24_PROCID_SHIFT		0
#define HSEM_HSEM_R24_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r24_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r25 HSEMR25 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R25_LOCK Lock indication **/
#define HSEM_HSEM_R25_LOCK		(1 << 31)

#define HSEM_HSEM_R25_MASTERID_SHIFT		8
#define HSEM_HSEM_R25_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r25_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R25_PROCID_SHIFT		0
#define HSEM_HSEM_R25_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r25_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r26 HSEMR26 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R26_LOCK Lock indication **/
#define HSEM_HSEM_R26_LOCK		(1 << 31)

