grevaillot/svd_tools/headers/STM32H750x/hsem.h
#define HSEM_HSEM_R26_MASTERID_SHIFT		8
#define HSEM_HSEM_R26_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r26_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R26_PROCID_SHIFT		0
#define HSEM_HSEM_R26_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r26_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r27 HSEMR27 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R27_LOCK Lock indication **/
#define HSEM_HSEM_R27_LOCK		(1 << 31)

#define HSEM_HSEM_R27_MASTERID_SHIFT		8
#define HSEM_HSEM_R27_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r27_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R27_PROCID_SHIFT		0
#define HSEM_HSEM_R27_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r27_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r28 HSEMR28 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R28_LOCK Lock indication **/
#define HSEM_HSEM_R28_LOCK		(1 << 31)

#define HSEM_HSEM_R28_MASTERID_SHIFT		8
#define HSEM_HSEM_R28_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r28_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R28_PROCID_SHIFT		0
#define HSEM_HSEM_R28_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r28_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r29 HSEMR29 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R29_LOCK Lock indication **/
#define HSEM_HSEM_R29_LOCK		(1 << 31)

#define HSEM_HSEM_R29_MASTERID_SHIFT		8
#define HSEM_HSEM_R29_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r29_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R29_PROCID_SHIFT		0
#define HSEM_HSEM_R29_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r29_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r30 HSEMR30 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R30_LOCK Lock indication **/
#define HSEM_HSEM_R30_LOCK		(1 << 31)

#define HSEM_HSEM_R30_MASTERID_SHIFT		8
#define HSEM_HSEM_R30_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r30_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R30_PROCID_SHIFT		0
#define HSEM_HSEM_R30_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r30_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r31 HSEMR31 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R31_LOCK Lock indication **/
#define HSEM_HSEM_R31_LOCK		(1 << 31)

#define HSEM_HSEM_R31_MASTERID_SHIFT		8
#define HSEM_HSEM_R31_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_r31_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_R31_PROCID_SHIFT		0
#define HSEM_HSEM_R31_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r31_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr0 HSEMRLR0 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR0_LOCK Lock indication **/
#define HSEM_HSEM_RLR0_LOCK		(1 << 31)

#define HSEM_HSEM_RLR0_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR0_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr0_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR0_PROCID_SHIFT		0
#define HSEM_HSEM_RLR0_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr0_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr1 HSEMRLR1 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR1_LOCK Lock indication **/
#define HSEM_HSEM_RLR1_LOCK		(1 << 31)

#define HSEM_HSEM_RLR1_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR1_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr1_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR1_PROCID_SHIFT		0
#define HSEM_HSEM_RLR1_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr1_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr2 HSEMRLR2 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR2_LOCK Lock indication **/
#define HSEM_HSEM_RLR2_LOCK		(1 << 31)

#define HSEM_HSEM_RLR2_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR2_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr2_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR2_PROCID_SHIFT		0
#define HSEM_HSEM_RLR2_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr2_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr3 HSEMRLR3 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR3_LOCK Lock indication **/
#define HSEM_HSEM_RLR3_LOCK		(1 << 31)

#define HSEM_HSEM_RLR3_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR3_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr3_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR3_PROCID_SHIFT		0
#define HSEM_HSEM_RLR3_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr3_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr4 HSEMRLR4 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR4_LOCK Lock indication **/
#define HSEM_HSEM_RLR4_LOCK		(1 << 31)

#define HSEM_HSEM_RLR4_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR4_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr4_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR4_PROCID_SHIFT		0
#define HSEM_HSEM_RLR4_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr4_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr5 HSEMRLR5 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR5_LOCK Lock indication **/
#define HSEM_HSEM_RLR5_LOCK		(1 << 31)

#define HSEM_HSEM_RLR5_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR5_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr5_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR5_PROCID_SHIFT		0
#define HSEM_HSEM_RLR5_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr5_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr6 HSEMRLR6 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR6_LOCK Lock indication **/
#define HSEM_HSEM_RLR6_LOCK		(1 << 31)

#define HSEM_HSEM_RLR6_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR6_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr6_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR6_PROCID_SHIFT		0
#define HSEM_HSEM_RLR6_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr6_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr7 HSEMRLR7 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR7_LOCK Lock indication **/
#define HSEM_HSEM_RLR7_LOCK		(1 << 31)

