grevaillot/svd_tools/headers/STM32H750x/hsem.h
#define HSEM_HSEM_RLR7_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR7_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr7_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR7_PROCID_SHIFT		0
#define HSEM_HSEM_RLR7_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr7_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr8 HSEMRLR8 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR8_LOCK Lock indication **/
#define HSEM_HSEM_RLR8_LOCK		(1 << 31)

#define HSEM_HSEM_RLR8_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR8_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr8_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR8_PROCID_SHIFT		0
#define HSEM_HSEM_RLR8_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr8_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr9 HSEMRLR9 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR9_LOCK Lock indication **/
#define HSEM_HSEM_RLR9_LOCK		(1 << 31)

#define HSEM_HSEM_RLR9_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR9_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr9_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR9_PROCID_SHIFT		0
#define HSEM_HSEM_RLR9_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr9_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr10 HSEMRLR10 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR10_LOCK Lock indication **/
#define HSEM_HSEM_RLR10_LOCK		(1 << 31)

#define HSEM_HSEM_RLR10_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR10_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr10_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR10_PROCID_SHIFT		0
#define HSEM_HSEM_RLR10_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr10_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr11 HSEMRLR11 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR11_LOCK Lock indication **/
#define HSEM_HSEM_RLR11_LOCK		(1 << 31)

#define HSEM_HSEM_RLR11_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR11_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr11_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR11_PROCID_SHIFT		0
#define HSEM_HSEM_RLR11_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr11_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr12 HSEMRLR12 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR12_LOCK Lock indication **/
#define HSEM_HSEM_RLR12_LOCK		(1 << 31)

#define HSEM_HSEM_RLR12_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR12_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr12_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR12_PROCID_SHIFT		0
#define HSEM_HSEM_RLR12_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr12_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr13 HSEMRLR13 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR13_LOCK Lock indication **/
#define HSEM_HSEM_RLR13_LOCK		(1 << 31)

#define HSEM_HSEM_RLR13_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR13_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr13_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR13_PROCID_SHIFT		0
#define HSEM_HSEM_RLR13_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr13_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr14 HSEMRLR14 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR14_LOCK Lock indication **/
#define HSEM_HSEM_RLR14_LOCK		(1 << 31)

#define HSEM_HSEM_RLR14_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR14_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr14_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR14_PROCID_SHIFT		0
#define HSEM_HSEM_RLR14_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr14_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr15 HSEMRLR15 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR15_LOCK Lock indication **/
#define HSEM_HSEM_RLR15_LOCK		(1 << 31)

#define HSEM_HSEM_RLR15_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR15_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr15_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR15_PROCID_SHIFT		0
#define HSEM_HSEM_RLR15_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr15_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr16 HSEMRLR16 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR16_LOCK Lock indication **/
#define HSEM_HSEM_RLR16_LOCK		(1 << 31)

#define HSEM_HSEM_RLR16_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR16_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr16_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR16_PROCID_SHIFT		0
#define HSEM_HSEM_RLR16_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr16_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr17 HSEMRLR17 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR17_LOCK Lock indication **/
#define HSEM_HSEM_RLR17_LOCK		(1 << 31)

#define HSEM_HSEM_RLR17_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR17_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr17_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR17_PROCID_SHIFT		0
#define HSEM_HSEM_RLR17_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr17_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr18 HSEMRLR18 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR18_LOCK Lock indication **/
#define HSEM_HSEM_RLR18_LOCK		(1 << 31)

#define HSEM_HSEM_RLR18_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR18_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr18_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR18_PROCID_SHIFT		0
#define HSEM_HSEM_RLR18_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr18_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr19 HSEMRLR19 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR19_LOCK Lock indication **/
#define HSEM_HSEM_RLR19_LOCK		(1 << 31)

#define HSEM_HSEM_RLR19_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR19_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr19_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR19_PROCID_SHIFT		0
#define HSEM_HSEM_RLR19_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr19_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr20 HSEMRLR20 HSEM Read lock register
@{*/

