grevaillot/svd_tools/headers/STM32H750x/hsem.h
/** HSEM_HSEM_RLR20_LOCK Lock indication **/
#define HSEM_HSEM_RLR20_LOCK		(1 << 31)

#define HSEM_HSEM_RLR20_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR20_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr20_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR20_PROCID_SHIFT		0
#define HSEM_HSEM_RLR20_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr20_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr21 HSEMRLR21 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR21_LOCK Lock indication **/
#define HSEM_HSEM_RLR21_LOCK		(1 << 31)

#define HSEM_HSEM_RLR21_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR21_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr21_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR21_PROCID_SHIFT		0
#define HSEM_HSEM_RLR21_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr21_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr22 HSEMRLR22 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR22_LOCK Lock indication **/
#define HSEM_HSEM_RLR22_LOCK		(1 << 31)

#define HSEM_HSEM_RLR22_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR22_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr22_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR22_PROCID_SHIFT		0
#define HSEM_HSEM_RLR22_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr22_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr23 HSEMRLR23 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR23_LOCK Lock indication **/
#define HSEM_HSEM_RLR23_LOCK		(1 << 31)

#define HSEM_HSEM_RLR23_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR23_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr23_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR23_PROCID_SHIFT		0
#define HSEM_HSEM_RLR23_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr23_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr24 HSEMRLR24 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR24_LOCK Lock indication **/
#define HSEM_HSEM_RLR24_LOCK		(1 << 31)

#define HSEM_HSEM_RLR24_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR24_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr24_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR24_PROCID_SHIFT		0
#define HSEM_HSEM_RLR24_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr24_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr25 HSEMRLR25 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR25_LOCK Lock indication **/
#define HSEM_HSEM_RLR25_LOCK		(1 << 31)

#define HSEM_HSEM_RLR25_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR25_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr25_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR25_PROCID_SHIFT		0
#define HSEM_HSEM_RLR25_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr25_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr26 HSEMRLR26 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR26_LOCK Lock indication **/
#define HSEM_HSEM_RLR26_LOCK		(1 << 31)

#define HSEM_HSEM_RLR26_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR26_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr26_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR26_PROCID_SHIFT		0
#define HSEM_HSEM_RLR26_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr26_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr27 HSEMRLR27 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR27_LOCK Lock indication **/
#define HSEM_HSEM_RLR27_LOCK		(1 << 31)

#define HSEM_HSEM_RLR27_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR27_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr27_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR27_PROCID_SHIFT		0
#define HSEM_HSEM_RLR27_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr27_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr28 HSEMRLR28 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR28_LOCK Lock indication **/
#define HSEM_HSEM_RLR28_LOCK		(1 << 31)

#define HSEM_HSEM_RLR28_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR28_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr28_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR28_PROCID_SHIFT		0
#define HSEM_HSEM_RLR28_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr28_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr29 HSEMRLR29 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR29_LOCK Lock indication **/
#define HSEM_HSEM_RLR29_LOCK		(1 << 31)

#define HSEM_HSEM_RLR29_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR29_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr29_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR29_PROCID_SHIFT		0
#define HSEM_HSEM_RLR29_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr29_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr30 HSEMRLR30 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR30_LOCK Lock indication **/
#define HSEM_HSEM_RLR30_LOCK		(1 << 31)

#define HSEM_HSEM_RLR30_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR30_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr30_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR30_PROCID_SHIFT		0
#define HSEM_HSEM_RLR30_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr30_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr31 HSEMRLR31 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR31_LOCK Lock indication **/
#define HSEM_HSEM_RLR31_LOCK		(1 << 31)

#define HSEM_HSEM_RLR31_MASTERID_SHIFT		8
#define HSEM_HSEM_RLR31_MASTERID_MASK		0xff
/** @defgroup hsem_hsem_rlr31_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_HSEM_RLR31_PROCID_SHIFT		0
#define HSEM_HSEM_RLR31_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr31_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_ier HSEMIER HSEM Interrupt enable register
@{*/

/** HSEM_HSEM_IER_ISEM31 Interrupt(N) semaphore n enable bit. **/
#define HSEM_HSEM_IER_ISEM31		(1 << 31)
/** HSEM_HSEM_IER_ISEM30 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM30		(1 << 30)
/** HSEM_HSEM_IER_ISEM29 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM29		(1 << 29)
/** HSEM_HSEM_IER_ISEM28 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM28		(1 << 28)
/** HSEM_HSEM_IER_ISEM27 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM27		(1 << 27)
/** HSEM_HSEM_IER_ISEM26 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM26		(1 << 26)
/** HSEM_HSEM_IER_ISEM25 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM25		(1 << 25)
/** HSEM_HSEM_IER_ISEM24 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM24		(1 << 24)
/** HSEM_HSEM_IER_ISEM23 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM23		(1 << 23)
/** HSEM_HSEM_IER_ISEM22 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM22		(1 << 22)
/** HSEM_HSEM_IER_ISEM21 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM21		(1 << 21)
/** HSEM_HSEM_IER_ISEM20 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM20		(1 << 20)
/** HSEM_HSEM_IER_ISEM19 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM19		(1 << 19)
/** HSEM_HSEM_IER_ISEM18 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM18		(1 << 18)
/** HSEM_HSEM_IER_ISEM17 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM17		(1 << 17)
/** HSEM_HSEM_IER_ISEM16 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM16		(1 << 16)
/** HSEM_HSEM_IER_ISEM15 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM15		(1 << 15)
/** HSEM_HSEM_IER_ISEM14 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM14		(1 << 14)
/** HSEM_HSEM_IER_ISEM13 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM13		(1 << 13)
/** HSEM_HSEM_IER_ISEM12 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM12		(1 << 12)
/** HSEM_HSEM_IER_ISEM11 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM11		(1 << 11)
/** HSEM_HSEM_IER_ISEM10 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM10		(1 << 10)
/** HSEM_HSEM_IER_ISEM9 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM9		(1 << 9)
/** HSEM_HSEM_IER_ISEM8 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM8		(1 << 8)
/** HSEM_HSEM_IER_ISEM7 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM7		(1 << 7)
/** HSEM_HSEM_IER_ISEM6 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM6		(1 << 6)
/** HSEM_HSEM_IER_ISEM5 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM5		(1 << 5)
/** HSEM_HSEM_IER_ISEM4 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM4		(1 << 4)
/** HSEM_HSEM_IER_ISEM3 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM3		(1 << 3)
/** HSEM_HSEM_IER_ISEM2 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM2		(1 << 2)
/** HSEM_HSEM_IER_ISEM1 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM1		(1 << 1)
/** HSEM_HSEM_IER_ISEM0 Interrupt semaphore n enable bit **/
#define HSEM_HSEM_IER_ISEM0		(1 << 0)

/**@}*/

